export const categories = [
    "Обувь",
    "Одежда",
    "Спорт и отдых",
    "Аксессуары",
    "Рукоделие",
    "Книги",
    "Красота и здоровье",
    "Товары для собак",
    "Детские товары",
    "Игры и консоли",
    "Электроника",
    "Ортопедия",
    "Канцелярские товары",
    "Дом и сад",
    "Антиквариат и коллекционирование",
    "Автотовары",
    "Видео",
    "Ножки для мебели",
]

export const radioOptions = [
    "Неважно", "До 7 дней"
]

export const BrandIconImage = [
    { brandText: "adidas", imageUrl: "https://ir.ozone.ru/s3/multimedia-m/wc50/6737518054.jpg" },
    { brandText: "adidas Originals", imageUrl: "https://ir.ozone.ru/s3/multimedia-2/wc50/6765347546.jpg" },
    { brandText: "nike", imageUrl: " https://ir.ozone.ru/s3/multimedia-m/wc50/6737518054.jpg" },
    { brandText: "rebook", imageUrl: " https://ir.ozone.ru/s3/multimedia-e/wc50/6737519054.jpg" },
    { brandText: "Puma", imageUrl: " https://ir.ozone.ru/s3/multimedia-p/wc50/6737519353.jpg" },
    { brandText: "Jordan", imageUrl: "https://ir.ozone.ru/s3/multimedia-n/wc50/6765579623.jpg" }

]

export const menuItems = ["Популярные", "Новинки", "Сначала дешёвые", "Сначала дорогие", "По размеру скидки", "Высокий рейтинг"];


export const gender = ["Мужской", "Женский", "Мальчики", "Девечки"];

export const russianSize = [42, 44, 46, 48, 50];



export const customScrollbarStyles = {

    '&::-webkit-scrollbar': {
        width: '6px',
        height: '20px'
    },
    '&::-webkit-scrollbar-track': {
        background: 'white',
    },
    '&::-webkit-scrollbar-thumb': {
        background: 'rgba(110, 110, 128, 0.5)',
        borderRadius: '3px',
    },
    '&:hover': {
        overflowY: 'auto', // Reveal scrollbar on hover
    },

};

export const intSizes = ["3XS", "XXS", "XS", "S", "M", "L", "XL", "XXL", "3XL", "4XL"];


export const colors = [
    { name: "Бежевый", value: "#F5F5DC" },
    { name: "Белый", value: "gray" },
    { name: "Бордовый", value: "#800000" },
    { name: "Голубой", value: "#00BFFF" },
    { name: "Желтый", value: "#FFFF00" },
    { name: "Зеленый", value: "#008000" },
    { name: "Золотой", value: "#FFD700" },
    { name: "Коричневый", value: "#A52A2A" },
    { name: "Красный", value: "#FF0000" },
    { name: "Оранжевый", value: "#FFA500" },
    { name: "Прозрачный", value: "transparent" },
    { name: "Разноцветный", value: "violet" },
    { name: "Розовый", value: "#FFC0CB" },
    { name: "Серебряный", value: "#C0C0C0" },
    { name: "Серый", value: "#808080" },
    { name: "Синий", value: "#0000FF" },
    { name: "Фиолетовый", value: "#800080" },
    { name: "Хаки", value: "#2E8B57" },
    { name: "Черный", value: "#000000" }
];

export const materials = [
    "Натуральная кожа",
    "Акрил",
    "Атлас",
    "Бамбуковое волокно",
    "Биопластик",
    "Бук",
    "Бумага",
    "Велюр искусственный",
    "Велюр натуральный",
    "Верблюжья шерсть",
    "Винил",
    "Вискоза",
    "Волокно",
    "Вспененная резина EPDM",
    "Вспененный полимер",
    "Вулканизированная резина",
    "Джерси",
    "Джинс",
    "Замша",
    "Замша искусственная",
    "Замша натуральная",
    "Интерлок",
    "Искусственная байка",
    "Искусственная кожа",
    "Искусственная смола",
    "Искусственная шерсть",
    "Искусственные материалы",
    "Искусственный каучук",
    "Картон",
    "Каучук",
    "Керамика",
    "Кожа",
    "Кожа крупного рогатого скота",
    "Кожа с покрытием",
    "Кокосовое волокно",
    "Композитный материал",
    "Кулирная гладь",
    "Лайкра",
    "Латекс",
    "Лен",
    "Лиоцелл",
    "Мембранные материалы",
    "Мериносовая шерсть",
    "Мерсеризованный хлопок",
    "Металл",
    "Металлизированная нить",
    "Металлический сплав",
    "Мех натуральный",
    "Микровельвет",
    "Микрофибра",
    "Модал",
    "Натуральный латекс",
    "Нейлон",
    "Неопрен",
    "Нубук",
    "Нубук искусственный",
    "Овечья шерсть",
    "Оксфорд",
    "Оксфорд нейлон",
    "ПАН",
    "ПВХ (поливинилхлорид)",
    "ПВХ, пластик, пенопласт, ткань",
    "ПЕВА (полиэтиленвинилацетат)",
    "Пена",
    "Пенополиуретан",
    "Переработанные материалы",
    "Пластик",
    "Пленка ПВХ",
    "Поларфлис",
    "Полиакрил",
    "Полиакрилонитрил",
    "Полиамид",
    "Полимерный материал",
    "Полипропилен",
    "Полиуретан",
    "Полиэстер",
    "Полиэстер с ПУ пропиткой",
    "Полиэтилен",
    "Полиэфир",
    "Полиэфирное волокно",
    "Полухлопок",
    "Район",
    "Резина",
    "Рибана",
    "Сетка",
    "Силикон",
    "Синтетика",
    "Синтетическая дышащая сетка",
    "Синтетическая кожа",
    "Синтетический сатин",
    "Смесовая ткань",
    "Спандекс",
    "Сталь",
    "Стрейч-коттон",
    "Тактель",
    "Текстилен",
    "Текстиль",
    "Термопластик (TPU)",
    "Тефлон",
    "Ткань",
    "ТПУ (термополиуретан)",
    "Триацетат",
    "Трикотаж",
    "Фанера",
    "Флис",
    "Футер",
    "Футер двухнитка",
    "Хлопковое напыление",
    "Хлопок",
    "Хромированная сталь",
    "Шелк",
    "Шерсть",
    "Экозамша",
    "Экокожа",
    "Экологичные материалы",
    "Эластан",
    "ABS пластик",
    "Breathable",
    "Dewspo",
    "EVA",
    "Softshell"
];

export const seasons = [
    "На любой сезон",
    "Демисезон",
    "Лето",
    "Зима",
    "Еврозима"
];